<?php
$host = 'localhost'; // Сервердің атауы, яғни дерекқор қай жерде орналасқан. 'localhost' - сол серверде орналасқан дегенді білдіреді.
$db = 'schedule'; // Қолданылатын дерекқордың атауы. Бұл жерде дерекқор атауы - 'schedule'.
$user = 'ваш_пользователь'; // Дерекқорға қосылуға арналған пайдаланушы аты. Оны дерекқор әкімшісі береді.
$pass = 'ваш_пароль'; // Пайдаланушының дерекқорға қосылу үшін қолданатын құпия сөзі.

try {
    // PDO (PHP Data Objects) арқылы дерекқорға қосылуды орнатамыз.
    // "mysql:host=$host;dbname=$db" - дерекқорға қосылу үшін қажетті деректер:
    // mysql - дерекқордың түрі, host - сервердің атауы, dbname - дерекқордың атауы.
    $pdo = new PDO("mysql:host=$host;dbname=$db", $user, $pass);
    // PDO объектісінің қасиеттерін орнату. Бұл жерде қатенің өңделу режимін орнатамыз.
    // PDO::ATTR_ERRMODE - қатенің өңделу режимі, PDO::ERRMODE_EXCEPTION - қатені ерекше жағдай ретінде өңдейді.
    $pdo->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);
} catch (PDOException $e) {
    // Егер дерекқорға қосылуда қате орын алса, ол 'catch' блогы арқылы өңделеді.
    // die() - функциясы дерекқорға қосылу мүмкін болмаған жағдайда мәтіндік хабарламаны шығарып, скрипттің жұмысын тоқтатады.
    // $e->getMessage() - қате туралы толық хабарлама көрсетіледі.
    die("Не удалось подключиться к базе данных: " . $e->getMessage());
}
?>